{
    "graphing software": "Computer software that provides features similar to those of a graphing calculator.",
    "hypothesis": "A proposed explanation or position that has yet to be tested.",
    "imperial system": "A system of weights and measures built on the basic units of measure of the yard (length), the pound (mass), the gallon (capacity), and the second (time). Also called the British system.",
    "inductive reasoning": "The process of reaching a conclusion or making a generalization on the basis of specific cases or examples.",
    "inference": "A conclusion based on a relationship identified between variables in a set of data.",
    "integer": "Any one of the numbers..., -4, -3, -2, -1, 0, +1, +2, +3, +4, ...",
    "intercept": "See x-intercept, y-intercept.",
    "interpolate": "To estimate values lying between elements of given data. For example, to interpolate from a graph means to estimate coordinates of points between those that are plotted.",
    "inverse operations": "Two operations that 'undo' or 'reverse' each other. For example, addition and subtraction are inverse operations, since a + b = c means that c - a = b. 'Squaring' and 'taking the square root' are inverse operations, since, for example, 5² = 25 and the (principal) square root of 25 is 5.",
    "linear relation": "A relation between two variables that appears as a straight line when graphed on a coordinate system. May also be referred to as a linear function.",
    "line of best fit": "The straight line that best describes the distribution of points in a scatter plot.",
    "manipulate": "To apply operations, such as addition, multiplication, or factoring, on algebraic expressions.",
    "mathematical model": "A mathematical description (e.g., a diagram, a graph, a table of values, an equation, a formula, a physical model, a computer model) of a situation.",
    "mathematical modelling": "The process of describing a situation in a mathematical form. See also mathematical model.",
    "median": "Geometry. The line drawn from a vertex of a triangle to the midpoint of the opposite side. Statistics. The middle number in a set, such that half the numbers in the set are less and half are greater when the numbers are arranged in order.",
    "method of elimination": "In solving systems of linear equations, a method in which the coefficients of one variable are matched through multiplication and then the equations are added or subtracted to eliminate that variable.",
    "method of substitution": "In solving systems of linear equations, a method in which one equation is rearranged and substituted into the other.",
    "model": "See mathematical model.",
    "monomial": "An algebraic expression with one term; for example, 5x².",
    "motion detector": "A hand-held device that uses ultrasound to measure distance. The data from motion detectors can be transmitted to graphing calculators.",
    "multiple trials": "A technique used in experimentation in which the same experiment is done several times and the results are combined through a measure such as averaging. The use of multiple trials 'smooths out' some of the random occurrences that can affect the outcome of an individual trial of an experiment.",
    "non-linear relation": "A relationship between two variables that does not fit a straight line when graphed.",
    "non-real root of an equation": "A solution to an equation that is not an element of the set of real numbers (e.g., √-16). See real root of an equation.",
    "optimal value": "The maximum or minimum value of a variable."
}