{
    "acute triangle": "A triangle in which each of the three interior angles measures less than 90°.",
    "algebra tiles": "Manipulatives that can be used to model operations involving integers, polynomials, and equations. Each tile represents a particular monomial, such as 1, x, or x².",
    "algebraic expression": "A collection of symbols, including one or more variables and possibly numbers and operation symbols. For example, 3x + 6, x, 5x, and 21 – 2w are all algebraic expressions.",
    "algebraic modelling": "The process of representing a relationship by an equation or a formula, or representing a pattern of numbers by an algebraic expression.",
    "algorithm": "A specific set of instructions for carrying out a procedure.",
    "altitude": "A line segment giving the height of a geometric figure. In a triangle, an altitude is found by drawing the perpendicular from a vertex to the side opposite.",
    "analytic geometry": "A geometry that uses the xy-plane to determine equations that represent lines and curves.",
    "angle bisector": "A line that divides an angle into two equal parts.",
    "angle of elevation": "The angle formed by the horizontal and the line of sight (to an object above the horizontal).",
    "application": "The use of mathematical concepts and skills to solve problems drawn from a variety of areas.",
    "binomial": "An algebraic expression containing two terms; for example, 3x + 2.",
    "chord": "A line segment joining two points on a curve.",
    "coefficient": "The factor by which a variable is multiplied. For example, in the term 5x, the coefficient is 5; in the term ax, the coefficient is a.",
    "computer algebra system (CAS)": "A software program that manipulates and displays mathematical expressions (and equations) symbolically.",
    "congruence": "The property of being congruent. Two geometric figures are congruent if they are equal in all respects.",
    "conjecture": "A guess or prediction based on limited evidence.",
    "constant rate of change": "A relationship between two variables illustrates a constant rate of change when equal intervals of the first variable are associated with equal intervals of the second variable. For example, if a car travels at 100 km/h, in the first hour it travels 100 km, in the second hour it travels 100 km, and so on.",
    "cosine law": "The relationship, for any triangle, involving the cosine of one of the angles and the lengths of the three sides; used to determine unknown sides and angles in triangles. If a triangle has sides a, b, and c, and if the angle A is opposite side a, then: a² = b² + c² - 2bc cos A.",
    "cosine ratio": "For either of the two acute angles in a right triangle, the ratio of the length of the adjacent side to the length of the hypotenuse.",
    "counter-example": "An example that proves that a hypothesis or conjecture is false.",
    "curve of best fit": "The curve that best describes the distribution of points in a scatter plot.",
    "deductive reasoning": "The process of reaching a conclusion by applying arguments that have already been proved and using evidence that is known to be true.",
    "diagonal": "In a polygon, a line segment joining two vertices that are not next to each other (i.e., not joined by one side).",
    "difference of squares": "An expression of the form a^2 - b^2, which involves the subtraction of two squares.",
    "direct variation": "A relationship between two variables in which one variable is a constant multiple of the other.",
    "dynamic geometry software": "Computer software that allows the user to plot points and create graphs on a coordinate system, measure line segments and angles, construct two-dimensional representations of three-dimensional objects, and transform constructed figures by moving parts of them.",
    "evaluate": "To determine a value for.",
    "exponent": "A special use of a superscript in mathematics. For example, in 3^2, the exponent is 2. An exponent is used to denote repeated multiplication. For example, 5^4 means 5 x 5 x 5 x 5.",
    "extrapolate": "To estimate values lying outside the range of given data. For example, to extrapolate from a graph means to estimate coordinates of points beyond those that are plotted.",
    "factor": "To express a number as the product of two or more numbers, or an algebraic expression as the product of two or more other algebraic expressions. Also, the individual numbers or algebraic expressions in such a product.",
    "finite differences": "Given a table of values in which the x-coordinates are evenly spaced, the first differences are calculated by subtracting consecutive y-coordinates. The second differences are calculated by subtracting consecutive first differences, and so on. In a linear relation, the first differences are constant; in a quadratic relation of the form y = ax^2 + bx + c (a ≠ 0), the second differences are constant. For example:",
    "first-degree equation": "An equation in which the variable has the exponent 1; for example, 5(3x - 1) + 6 = -20 + 7x + 5.",
    "first-degree polynomial": "A polynomial in which the variable has the exponent 1; for example, 4x + 20.",
    "generalize": "To determine a general rule or make a conclusion from examples. Specifically, to determine a general rule to represent a pattern or relationship between variables.",
    "graphing calculator": "A hand-held device capable of a wide range of mathematical operations, including graphing from an equation, constructing a scatter plot, determining the equation of a curve of best fit for a scatter plot, making statistical calculations, performing symbolic manipulation. Many graphing calculators will attach to scientific probes that can be used to gather data involving physical measurements (e.g., position, temperature, force).",
    "graphing software": "Computer software that provides features similar to those of a graphing calculator.",
    "hypothesis": "A proposed explanation or position that has yet to be tested.",
    "imperial system": "A system of weights and measures built on the basic units of measure of the yard (length), the pound (mass), the gallon (capacity), and the second (time). Also called the British system.",
    "inductive reasoning": "The process of reaching a conclusion or making a generalization on the basis of specific cases or examples.",
    "inference": "A conclusion based on a relationship identified between variables in a set of data.",
    "integer": "Any one of the numbers..., -4, -3, -2, -1, 0, +1, +2, +3, +4, ...",
    "intercept": "See x-intercept, y-intercept.",
    "interpolate": "To estimate values lying between elements of given data. For example, to interpolate from a graph means to estimate coordinates of points between those that are plotted.",
    "inverse operations": "Two operations that 'undo' or 'reverse' each other. For example, addition and subtraction are inverse operations, since a + b = c means that c - a = b. 'Squaring' and 'taking the square root' are inverse operations, since, for example, 5² = 25 and the (principal) square root of 25 is 5.",
    "linear relation": "A relation between two variables that appears as a straight line when graphed on a coordinate system. May also be referred to as a linear function.",
    "line of best fit": "The straight line that best describes the distribution of points in a scatter plot.",
    "manipulate": "To apply operations, such as addition, multiplication, or factoring, on algebraic expressions.",
    "mathematical model": "A mathematical description (e.g., a diagram, a graph, a table of values, an equation, a formula, a physical model, a computer model) of a situation.",
    "mathematical modelling": "The process of describing a situation in a mathematical form. See also mathematical model.",
    "median": "Geometry. The line drawn from a vertex of a triangle to the midpoint of the opposite side. Statistics. The middle number in a set, such that half the numbers in the set are less and half are greater when the numbers are arranged in order.",
    "method of elimination": "In solving systems of linear equations, a method in which the coefficients of one variable are matched through multiplication and then the equations are added or subtracted to eliminate that variable.",
    "method of substitution": "In solving systems of linear equations, a method in which one equation is rearranged and substituted into the other.",
    "model": "See mathematical model.",
    "monomial": "An algebraic expression with one term; for example, 5x².",
    "motion detector": "A hand-held device that uses ultrasound to measure distance. The data from motion detectors can be transmitted to graphing calculators.",
    "multiple trials": "A technique used in experimentation in which the same experiment is done several times and the results are combined through a measure such as averaging. The use of multiple trials 'smooths out' some of the random occurrences that can affect the outcome of an individual trial of an experiment.",
    "non-linear relation": "A relationship between two variables that does not fit a straight line when graphed.",
    "non-real root of an equation": "A solution to an equation that is not an element of the set of real numbers (e.g., √-16). See real root of an equation.",
    "optimal value": "The maximum or minimum value of a variable."
}